{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "size_of_axes" : 1,
      "bottom" : "logmel_data",
      "axes_0" : -2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "expand_dims_0",
      "top" : "expand_dims_0",
      "type" : "expand_dims",
      "name" : "expand_dims_0"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "top" : "conv_0",
      "blob_weights" : 3,
      "K" : 80,
      "blob_biases" : 1,
      "name" : "conv_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "expand_dims_0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "size_of_axes" : 1,
      "bottom" : "conv_0",
      "axes_0" : -2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "28",
      "version" : 1,
      "top" : "28",
      "type" : "squeeze",
      "name" : "28"
    },
    {
      "bottom" : "28",
      "weights" : {

      },
      "mode" : 19,
      "debug_info" : "input.1",
      "top" : "input.1",
      "type" : "activation",
      "name" : "input.1"
    },
    {
      "size_of_axes" : 1,
      "bottom" : "input.1",
      "axes_0" : -2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "expand_dims_2",
      "top" : "expand_dims_2",
      "type" : "expand_dims",
      "name" : "expand_dims_2"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "top" : "conv_1",
      "blob_weights" : 7,
      "K" : 384,
      "blob_biases" : 5,
      "stride_x" : 2,
      "name" : "conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "expand_dims_2",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "size_of_axes" : 1,
      "bottom" : "conv_1",
      "axes_0" : -2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "46",
      "version" : 1,
      "top" : "46",
      "type" : "squeeze",
      "name" : "46"
    },
    {
      "bottom" : "46",
      "weights" : {

      },
      "mode" : 19,
      "debug_info" : "x.3",
      "top" : "x.3",
      "type" : "activation",
      "name" : "x.3"
    },
    {
      "top" : "51",
      "w" : 1500,
      "h" : 384,
      "name" : "51",
      "nd_rank" : 2,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "51",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 9
    },
    {
      "bottom" : "51,x.3",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "53",
      "top" : "53",
      "type" : "elementwise",
      "name" : "53",
      "beta" : 0
    },
    {
      "size_of_axes" : 1,
      "bottom" : "53",
      "axes_0" : 2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "inputs.1",
      "top" : "inputs.1",
      "type" : "expand_dims",
      "name" : "inputs.1"
    },
    {
      "axis_mode" : 4,
      "bottom" : "inputs.1",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "input.3_mean",
      "use_version" : 1,
      "top" : "input.3_mean",
      "type" : "reduce",
      "name" : "input.3_mean"
    },
    {
      "bottom" : "inputs.1,input.3_mean",
      "alpha" : 1,
      "operation" : 33,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.3_sub_mean",
      "nd_mode" : true,
      "top" : "input.3_sub_mean",
      "type" : "elementwise",
      "name" : "input.3_sub_mean",
      "beta" : 0
    },
    {
      "bottom" : "input.3_sub_mean",
      "alpha" : 2,
      "operation" : 13,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.3_square",
      "top" : "input.3_square",
      "type" : "elementwise",
      "name" : "input.3_square",
      "beta" : 0
    },
    {
      "axis_mode" : 4,
      "bottom" : "input.3_square",
      "weights" : {

      },
      "mode" : 0,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "input.3_square_sum",
      "use_version" : 1,
      "top" : "input.3_square_sum",
      "type" : "reduce",
      "name" : "input.3_square_sum"
    },
    {
      "top" : "input.3_div_constant",
      "w" : 1,
      "h" : 1,
      "name" : "input.3_div_constant",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "input.3_div_constant",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 11
    },
    {
      "bottom" : "input.3_square_sum,input.3_div_constant",
      "alpha" : 1,
      "operation" : 102,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.3_div_square_sum",
      "nd_mode" : true,
      "top" : "input.3_div_square_sum",
      "type" : "elementwise",
      "name" : "input.3_div_square_sum",
      "beta" : 0
    },
    {
      "top" : "input.3_epsilon",
      "w" : 1,
      "h" : 1,
      "name" : "input.3_epsilon",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "input.3_epsilon",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 13
    },
    {
      "bottom" : "input.3_div_square_sum,input.3_epsilon",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.3_add_epsilon",
      "top" : "input.3_add_epsilon",
      "type" : "elementwise",
      "name" : "input.3_add_epsilon",
      "beta" : 0
    },
    {
      "bottom" : "input.3_add_epsilon",
      "alpha" : 1,
      "operation" : 11,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.3_sqrt",
      "top" : "input.3_sqrt",
      "type" : "elementwise",
      "name" : "input.3_sqrt",
      "beta" : 0
    },
    {
      "bottom" : "input.3_sub_mean,input.3_sqrt",
      "alpha" : 1,
      "operation" : 102,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.3_divide",
      "nd_mode" : true,
      "top" : "input.3_divide",
      "type" : "elementwise",
      "name" : "input.3_divide",
      "beta" : 0
    },
    {
      "top" : "input.3_gamma",
      "w" : 1,
      "h" : 1,
      "name" : "input.3_gamma",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 384,
      "bottom" : "",
      "debug_info" : "input.3_gamma",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 15
    },
    {
      "top" : "input.3_beta",
      "w" : 1,
      "h" : 1,
      "name" : "input.3_beta",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 384,
      "bottom" : "",
      "debug_info" : "input.3_beta",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 17
    },
    {
      "bottom" : "input.3_divide,input.3_gamma",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.3_mul",
      "nd_mode" : true,
      "top" : "input.3_mul",
      "type" : "elementwise",
      "name" : "input.3_mul",
      "beta" : 0
    },
    {
      "bottom" : "input.3_mul,input.3_beta",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.3",
      "nd_mode" : true,
      "top" : "input.3",
      "type" : "elementwise",
      "name" : "input.3",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "119",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "119",
      "blob_weights" : 21,
      "K" : 384,
      "blob_biases" : 19,
      "name" : "119",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "input.3",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "k.1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "k.1",
      "blob_weights" : 23,
      "K" : 384,
      "name" : "k.1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 384,
      "bottom" : "input.3",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "117",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "117",
      "blob_weights" : 27,
      "K" : 384,
      "blob_biases" : 25,
      "name" : "117",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "input.3",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : 1,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "num_splits" : 6,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "119",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "120",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "120",
      "begin_48" : 0,
      "top" : "120_0,120_1,120_2,120_3,120_4,120_5",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "axis_h" : 1,
      "axis_w" : 2,
      "bottom" : "k.1",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_4",
      "top" : "127",
      "type" : "transpose",
      "name" : "transpose_4"
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : 3,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "num_splits" : 6,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "127",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "128",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "128",
      "begin_48" : 0,
      "top" : "128_0,128_1,128_2,128_3,128_4,128_5",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : 1,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "num_splits" : 6,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "117",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "135",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "135",
      "begin_48" : 0,
      "top" : "135_0,135_1,135_2,135_3,135_4,135_5",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "128_0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.1_transpose_x",
      "top" : "aw.1_transpose_1",
      "type" : "transpose",
      "name" : "aw.1_transpose_x"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "120_0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.1_transpose_y",
      "top" : "aw.1_transpose_2",
      "type" : "transpose",
      "name" : "aw.1_transpose_y"
    },
    {
      "bottom" : "aw.1_transpose_1,aw.1_transpose_2",
      "weights" : {

      },
      "debug_info" : "aw.1_batch_matmul",
      "top" : "aw.1_pre_transpose",
      "type" : "batch_matmul",
      "name" : "aw.1_batch_matmul",
      "channel_mode" : false
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "aw.1_pre_transpose",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.1",
      "top" : "aw.1",
      "type" : "transpose",
      "name" : "aw.1"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "128_1",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.3_transpose_x",
      "top" : "aw.3_transpose_1",
      "type" : "transpose",
      "name" : "aw.3_transpose_x"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "120_1",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.3_transpose_y",
      "top" : "aw.3_transpose_2",
      "type" : "transpose",
      "name" : "aw.3_transpose_y"
    },
    {
      "bottom" : "aw.3_transpose_1,aw.3_transpose_2",
      "weights" : {

      },
      "debug_info" : "aw.3_batch_matmul",
      "top" : "aw.3_pre_transpose",
      "type" : "batch_matmul",
      "name" : "aw.3_batch_matmul",
      "channel_mode" : false
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "aw.3_pre_transpose",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.3",
      "top" : "aw.3",
      "type" : "transpose",
      "name" : "aw.3"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "128_2",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.5_transpose_x",
      "top" : "aw.5_transpose_1",
      "type" : "transpose",
      "name" : "aw.5_transpose_x"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "120_2",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.5_transpose_y",
      "top" : "aw.5_transpose_2",
      "type" : "transpose",
      "name" : "aw.5_transpose_y"
    },
    {
      "bottom" : "aw.5_transpose_1,aw.5_transpose_2",
      "weights" : {

      },
      "debug_info" : "aw.5_batch_matmul",
      "top" : "aw.5_pre_transpose",
      "type" : "batch_matmul",
      "name" : "aw.5_batch_matmul",
      "channel_mode" : false
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "aw.5_pre_transpose",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.5",
      "top" : "aw.5",
      "type" : "transpose",
      "name" : "aw.5"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "128_3",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.7_transpose_x",
      "top" : "aw.7_transpose_1",
      "type" : "transpose",
      "name" : "aw.7_transpose_x"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "120_3",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.7_transpose_y",
      "top" : "aw.7_transpose_2",
      "type" : "transpose",
      "name" : "aw.7_transpose_y"
    },
    {
      "bottom" : "aw.7_transpose_1,aw.7_transpose_2",
      "weights" : {

      },
      "debug_info" : "aw.7_batch_matmul",
      "top" : "aw.7_pre_transpose",
      "type" : "batch_matmul",
      "name" : "aw.7_batch_matmul",
      "channel_mode" : false
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "aw.7_pre_transpose",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.7",
      "top" : "aw.7",
      "type" : "transpose",
      "name" : "aw.7"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "128_4",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.9_transpose_x",
      "top" : "aw.9_transpose_1",
      "type" : "transpose",
      "name" : "aw.9_transpose_x"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "120_4",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.9_transpose_y",
      "top" : "aw.9_transpose_2",
      "type" : "transpose",
      "name" : "aw.9_transpose_y"
    },
    {
      "bottom" : "aw.9_transpose_1,aw.9_transpose_2",
      "weights" : {

      },
      "debug_info" : "aw.9_batch_matmul",
      "top" : "aw.9_pre_transpose",
      "type" : "batch_matmul",
      "name" : "aw.9_batch_matmul",
      "channel_mode" : false
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "aw.9_pre_transpose",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.9",
      "top" : "aw.9",
      "type" : "transpose",
      "name" : "aw.9"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "128_5",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.11_transpose_x",
      "top" : "aw.11_transpose_1",
      "type" : "transpose",
      "name" : "aw.11_transpose_x"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "120_5",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.11_transpose_y",
      "top" : "aw.11_transpose_2",
      "type" : "transpose",
      "name" : "aw.11_transpose_y"
    },
    {
      "bottom" : "aw.11_transpose_1,aw.11_transpose_2",
      "weights" : {

      },
      "debug_info" : "aw.11_batch_matmul",
      "top" : "aw.11_pre_transpose",
      "type" : "batch_matmul",
      "name" : "aw.11_batch_matmul",
      "channel_mode" : false
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "aw.11_pre_transpose",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "aw.11",
      "top" : "aw.11",
      "type" : "transpose",
      "name" : "aw.11"
    },
    {
      "bottom" : "aw.1",
      "weights" : {

      },
      "debug_info" : "154",
      "top" : "154",
      "C" : 2,
      "type" : "softmax",
      "name" : "154"
    },
    {
      "bottom" : "aw.3",
      "weights" : {

      },
      "debug_info" : "155",
      "top" : "155",
      "C" : 2,
      "type" : "softmax",
      "name" : "155"
    },
    {
      "bottom" : "aw.5",
      "weights" : {

      },
      "debug_info" : "156",
      "top" : "156",
      "C" : 2,
      "type" : "softmax",
      "name" : "156"
    },
    {
      "bottom" : "aw.7",
      "weights" : {

      },
      "debug_info" : "157",
      "top" : "157",
      "C" : 2,
      "type" : "softmax",
      "name" : "157"
    },
    {
      "bottom" : "aw.9",
      "weights" : {

      },
      "debug_info" : "158",
      "top" : "158",
      "C" : 2,
      "type" : "softmax",
      "name" : "158"
    },
    {
      "bottom" : "aw.11",
      "weights" : {

      },
      "debug_info" : "159",
      "top" : "159",
      "C" : 2,
      "type" : "softmax",
      "name" : "159"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "135_0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "161_transpose_x",
      "top" : "161_transpose_1",
      "type" : "transpose",
      "name" : "161_transpose_x"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "154",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "161_transpose_y",
      "top" : "161_transpose_2",
      "type" : "transpose",
      "name" : "161_transpose_y"
    },
    {
      "bottom" : "161_transpose_1,161_transpose_2",
      "weights" : {

      },
      "debug_info" : "161_batch_matmul",
      "top" : "161_pre_transpose",
      "type" : "batch_matmul",
      "name" : "161_batch_matmul",
      "channel_mode" : false
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "161_pre_transpose",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "161",
      "top" : "161",
      "type" : "transpose",
      "name" : "161"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "135_1",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "163_transpose_x",
      "top" : "163_transpose_1",
      "type" : "transpose",
      "name" : "163_transpose_x"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "155",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "163_transpose_y",
      "top" : "163_transpose_2",
      "type" : "transpose",
      "name" : "163_transpose_y"
    },
    {
      "bottom" : "163_transpose_1,163_transpose_2",
      "weights" : {

      },
      "debug_info" : "163_batch_matmul",
      "top" : "163_pre_transpose",
      "type" : "batch_matmul",
      "name" : "163_batch_matmul",
      "channel_mode" : false
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "163_pre_transpose",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "163",
      "top" : "163",
      "type" : "transpose",
      "name" : "163"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "135_2",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "165_transpose_x",
      "top" : "165_transpose_1",
      "type" : "transpose",
      "name" : "165_transpose_x"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "156",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "165_transpose_y",
      "top" : "165_transpose_2",
      "type" : "transpose",
      "name" : "165_transpose_y"
    },
    {
      "bottom" : "165_transpose_1,165_transpose_2",
      "weights" : {

      },
      "debug_info" : "165_batch_matmul",
      "top" : "165_pre_transpose",
      "type" : "batch_matmul",
      "name" : "165_batch_matmul",
      "channel_mode" : false
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "165_pre_transpose",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "165",
      "top" : "165",
      "type" : "transpose",
      "name" : "165"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "135_3",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "167_transpose_x",
      "top" : "167_transpose_1",
      "type" : "transpose",
      "name" : "167_transpose_x"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "157",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "167_transpose_y",
      "top" : "167_transpose_2",
      "type" : "transpose",
      "name" : "167_transpose_y"
    },
    {
      "bottom" : "167_transpose_1,167_transpose_2",
      "weights" : {

      },
      "debug_info" : "167_batch_matmul",
      "top" : "167_pre_transpose",
      "type" : "batch_matmul",
      "name" : "167_batch_matmul",
      "channel_mode" : false
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "167_pre_transpose",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "167",
      "top" : "167",
      "type" : "transpose",
      "name" : "167"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "135_4",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "169_transpose_x",
      "top" : "169_transpose_1",
      "type" : "transpose",
      "name" : "169_transpose_x"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "158",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "169_transpose_y",
      "top" : "169_transpose_2",
      "type" : "transpose",
      "name" : "169_transpose_y"
    },
    {
      "bottom" : "169_transpose_1,169_transpose_2",
      "weights" : {

      },
      "debug_info" : "169_batch_matmul",
      "top" : "169_pre_transpose",
      "type" : "batch_matmul",
      "name" : "169_batch_matmul",
      "channel_mode" : false
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "169_pre_transpose",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "169",
      "top" : "169",
      "type" : "transpose",
      "name" : "169"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "135_5",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "171_transpose_x",
      "top" : "171_transpose_1",
      "type" : "transpose",
      "name" : "171_transpose_x"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "159",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "171_transpose_y",
      "top" : "171_transpose_2",
      "type" : "transpose",
      "name" : "171_transpose_y"
    },
    {
      "bottom" : "171_transpose_1,171_transpose_2",
      "weights" : {

      },
      "debug_info" : "171_batch_matmul",
      "top" : "171_pre_transpose",
      "type" : "batch_matmul",
      "name" : "171_batch_matmul",
      "channel_mode" : false
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "171_pre_transpose",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "171",
      "top" : "171",
      "type" : "transpose",
      "name" : "171"
    },
    {
      "weights" : {

      },
      "debug_info" : "input.5",
      "top" : "input.5",
      "type" : "concat",
      "name" : "input.5",
      "bottom" : "161,163,165,167,169,171"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "180",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "180",
      "blob_weights" : 31,
      "K" : 384,
      "blob_biases" : 29,
      "name" : "180",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "input.5",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "inputs.1,180",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "inputs.3",
      "top" : "inputs.3",
      "type" : "elementwise",
      "name" : "inputs.3",
      "beta" : 0
    },
    {
      "axis_mode" : 4,
      "bottom" : "inputs.3",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "input.7_mean",
      "use_version" : 1,
      "top" : "input.7_mean",
      "type" : "reduce",
      "name" : "input.7_mean"
    },
    {
      "bottom" : "inputs.3,input.7_mean",
      "alpha" : 1,
      "operation" : 33,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.7_sub_mean",
      "nd_mode" : true,
      "top" : "input.7_sub_mean",
      "type" : "elementwise",
      "name" : "input.7_sub_mean",
      "beta" : 0
    },
    {
      "bottom" : "input.7_sub_mean",
      "alpha" : 2,
      "operation" : 13,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.7_square",
      "top" : "input.7_square",
      "type" : "elementwise",
      "name" : "input.7_square",
      "beta" : 0
    },
    {
      "axis_mode" : 4,
      "bottom" : "input.7_square",
      "weights" : {

      },
      "mode" : 0,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "input.7_square_sum",
      "use_version" : 1,
      "top" : "input.7_square_sum",
      "type" : "reduce",
      "name" : "input.7_square_sum"
    },
    {
      "top" : "input.7_div_constant",
      "w" : 1,
      "h" : 1,
      "name" : "input.7_div_constant",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "input.7_div_constant",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 33
    },
    {
      "bottom" : "input.7_square_sum,input.7_div_constant",
      "alpha" : 1,
      "operation" : 102,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.7_div_square_sum",
      "nd_mode" : true,
      "top" : "input.7_div_square_sum",
      "type" : "elementwise",
      "name" : "input.7_div_square_sum",
      "beta" : 0
    },
    {
      "top" : "input.7_epsilon",
      "w" : 1,
      "h" : 1,
      "name" : "input.7_epsilon",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "input.7_epsilon",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 35
    },
    {
      "bottom" : "input.7_div_square_sum,input.7_epsilon",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.7_add_epsilon",
      "top" : "input.7_add_epsilon",
      "type" : "elementwise",
      "name" : "input.7_add_epsilon",
      "beta" : 0
    },
    {
      "bottom" : "input.7_add_epsilon",
      "alpha" : 1,
      "operation" : 11,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.7_sqrt",
      "top" : "input.7_sqrt",
      "type" : "elementwise",
      "name" : "input.7_sqrt",
      "beta" : 0
    },
    {
      "bottom" : "input.7_sub_mean,input.7_sqrt",
      "alpha" : 1,
      "operation" : 102,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.7_divide",
      "nd_mode" : true,
      "top" : "input.7_divide",
      "type" : "elementwise",
      "name" : "input.7_divide",
      "beta" : 0
    },
    {
      "top" : "input.7_gamma",
      "w" : 1,
      "h" : 1,
      "name" : "input.7_gamma",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 384,
      "bottom" : "",
      "debug_info" : "input.7_gamma",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 37
    },
    {
      "top" : "input.7_beta",
      "w" : 1,
      "h" : 1,
      "name" : "input.7_beta",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 384,
      "bottom" : "",
      "debug_info" : "input.7_beta",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 39
    },
    {
      "bottom" : "input.7_divide,input.7_gamma",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.7_mul",
      "nd_mode" : true,
      "top" : "input.7_mul",
      "type" : "elementwise",
      "name" : "input.7_mul",
      "beta" : 0
    },
    {
      "bottom" : "input.7_mul,input.7_beta",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.7",
      "nd_mode" : true,
      "top" : "input.7",
      "type" : "elementwise",
      "name" : "input.7",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.9",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.9",
      "blob_weights" : 43,
      "K" : 384,
      "blob_biases" : 41,
      "name" : "input.9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1536,
      "bottom" : "input.7",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.9",
      "weights" : {

      },
      "mode" : 19,
      "debug_info" : "input.11",
      "top" : "input.11",
      "type" : "activation",
      "name" : "input.11"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "216",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "216",
      "blob_weights" : 47,
      "K" : 1536,
      "blob_biases" : 45,
      "name" : "216",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "input.11",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "inputs.3,216",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "inputs.5",
      "top" : "inputs.5",
      "type" : "elementwise",
      "name" : "inputs.5",
      "beta" : 0
    },
    {
      "axis_mode" : 4,
      "bottom" : "inputs.5",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "input.13_mean",
      "use_version" : 1,
      "top" : "input.13_mean",
      "type" : "reduce",
      "name" : "input.13_mean"
    },
    {
      "bottom" : "inputs.5,input.13_mean",
      "alpha" : 1,
      "operation" : 33,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.13_sub_mean",
      "nd_mode" : true,
      "top" : "input.13_sub_mean",
      "type" : "elementwise",
      "name" : "input.13_sub_mean",
      "beta" : 0
    },
    {
      "bottom" : "input.13_sub_mean",
      "alpha" : 2,
      "operation" : 13,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.13_square",
      "top" : "input.13_square",
      "type" : "elementwise",
      "name" : "input.13_square",
      "beta" : 0
    },
    {
      "axis_mode" : 4,
      "bottom" : "input.13_square",
      "weights" : {

      },
      "mode" : 0,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "input.13_square_sum",
      "use_version" : 1,
      "top" : "input.13_square_sum",
      "type" : "reduce",
      "name" : "input.13_square_sum"
    },
    {
      "top" : "input.13_div_constant",
      "w" : 1,
      "h" : 1,
      "name" : "input.13_div_constant",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "input.13_div_constant",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 49
    },
    {
      "bottom" : "input.13_square_sum,input.13_div_constant",
      "alpha" : 1,
      "operation" : 102,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.13_div_square_sum",
      "nd_mode" : true,
      "top" : "input.13_div_square_sum",
      "type" : "elementwise",
      "name" : "input.13_div_square_sum",
      "beta" : 0
    },
    {
      "top" : "input.13_epsilon",
      "w" : 1,
      "h" : 1,
      "name" : "input.13_epsilon",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "input.13_epsilon",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 51
    },
    {
      "bottom" : "input.13_div_square_sum,input.13_epsilon",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.13_add_epsilon",
      "top" : "input.13_add_epsilon",
      "type" : "elementwise",
      "name" : "input.13_add_epsilon",
      "beta" : 0
    },
    {
      "bottom" : "input.13_add_epsilon",
      "alpha" : 1,
      "operation" : 11,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.13_sqrt",
      "top" : "input.13_sqrt",
      "type" : "elementwise",
      "name" : "input.13_sqrt",
      "beta" : 0
    },
    {
      "bottom" : "input.13_sub_mean,input.13_sqrt",
      "alpha" : 1,
      "operation" : 102,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.13_divide",
      "nd_mode" : true,
      "top" : "input.13_divide",
      "type" : "elementwise",
      "name" : "input.13_divide",
      "beta" : 0
    },
    {
      "top" : "input.13_gamma",
      "w" : 1,
      "h" : 1,
      "name" : "input.13_gamma",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 384,
      "bottom" : "",
      "debug_info" : "input.13_gamma",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 53
    },
    {
      "top" : "input.13_beta",
      "w" : 1,
      "h" : 1,
      "name" : "input.13_beta",
      "nd_rank" : 4,
      "type" : "load_constant",
      "k" : 384,
      "bottom" : "",
      "debug_info" : "input.13_beta",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 55
    },
    {
      "bottom" : "input.13_divide,input.13_gamma",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.13_mul",
      "nd_mode" : true,
      "top" : "input.13_mul",
      "type" : "elementwise",
      "name" : "input.13_mul",
      "beta" : 0
    },
    {
      "bottom" : "input.13_mul,input.13_beta",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.13",
      "nd_mode" : true,
      "top" : "input.13",
      "type" : "elementwise",
      "name" : "input.13",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "276",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "276",
      "blob_weights" : 59,
      "K" : 384,
      "blob_biases" : 57,
      "name" : "276",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "input.13",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "k.3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "k.3",
      "blob_weights" : 61,
      "K" : 384,
      "name" : "k.3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 384,
      "bottom" : "input.13",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "274",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "274",
      "blob_weights" : 65,
      "K" : 384,
      "blob_biases" : 63,
      "name" : "274",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "input.13",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : 1,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "num_splits" : 6,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "276",
      "begin_3" : 0,
